'''
Вычислите 2179. Выведите на экран вычисленное значение.

Sample Input:

Sample Output:
766247770432944429179173513575154591809369561091801088
'''
res = 2**179
print(res)
