'''
Напишите программу, которая напечатает букву "A" (латинскую) 133 раза подряд.
Используйте смекалку, а не трудолюбие.
Латинская A, а не русская А.  Обратите внимание на раскладку клавиатуры.

Sample Input:

Sample Output:
AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA
'''
# put your python code here
print('A'*133)
