'''
Напишите программу, которая выводит строку "Python" без кавычек.

Sample Input:  

Sample Output:
Python
'''
# put your python code here
print('Python')




