'''
Выведите строку задом наперед

Sample Input:
hello

Sample Output:
olleh
'''
a = input()
print(a[::-1])

